Repository: TARUNprojectworks/AI-Crop-Diagnosis-System
Catalog: lib/l10n/app_*.arb
Languages: ta, te

# appTitle
source: Crop Disease Diagnosis
ta: பயிர் நோய் கண்டறிதல்
te: పంట వ్యాధి నిర్ధారణ

source: Capture Photo
ta: புகைப்படம் எடுக்கவும்
te: ఫోటో తీయండి

source: Select from Gallery
ta: கேலரியிலிருந்து தேர்ந்தெடுக்கவும்
te: గ్యాలరీ నుండి ఎంచుకోండి

source: Camera
ta: கேமரா
te: కెమెరా

source: Gallery
ta: கேலரி
te: గ్యాలరీ

# submit
source: Submit for Diagnosis
ta: கண்டறிதலுக்கு சமர்ப்பிக்கவும்
te: నిర్ధారణ కోసం సమర్పించండి

source: Retake
ta: மீண்டும் எடுக்கவும்
te: మళ్లీ తీయండి

source: Settings
ta: அமைப்புகள்
te: సెట్టింగ్‌లు

source: Language
ta: மொழி
te: భాష

source: Theme
ta: தீம்
te: థీమ్

source: Font Size
ta: எழுத்துரு அளவு
te: ఫాంట్ పరిమాణం

source: Offline
ta: ஆஃப்லைன்
te: ఆఫ్‌లైన్

source: Online
ta: ஆன்லைன்
te: ఆన్‌లైన్

# savedOffline
source: Saved offline. Will upload when connected.
ta: ஆஃப்லைனில் சேமிக்கப்பட்டது। இணைக்கப்பட்டதும் பதிவேற்றப்படும்।
te: ఆఫ్‌లైన్‌లో సేవ్ చేయబడింది। కనెక్ట్ అయినప్పుడు అప్‌లోడ్ అవుతుంది।

source: Submitted successfully!
ta: வெற்றிகரமாக சமர்ப்பிக்கப்பட்டது!
te: విజయవంతంగా సమర్పించబడింది!

source: Uploading...
ta: பதிவேற்றப்படுகிறது...
te: అప్‌లోడ్ అవుతోంది...

source: Processing...
ta: செயலாக்கப்படுகிறது...
te: ప్రాసెస్ చేయబడుతోంది...

source: Light Mode
ta: லைட் மோட்
te: లైట్ మోడ్

source: Dark Mode
ta: டார்க் மோட்
te: డార్క్ మోడ్

source: Small
ta: சிறிய
te: చిన్నది

source: Medium
ta: நடுத்தர
te: మధ్యస్థం

source: Large
ta: பெரிய
te: పెద్దది

# welcomeTitle
source: Welcome to Crop Disease Diagnosis
ta: பயிர் நோய் கண்டறிதலுக்கு வரவேற்கிறோம்
te: పంట వ్యాధి నిర్ధారణకు స్వాగతం

# welcomeMessage
source: Identify crop diseases quickly and get remediation guidance
ta: பயிர் நோய்களை விரைவாக அடையாளம் கண்டு சிகிச்சை வழிகாட்டுதலைப் பெறுங்கள்
te: పంట వ్యాధులను త్వరగా గుర్తించండి మరియు చికిత్స మార్గదర్శకత్వం పొందండి

# onboardingStep1Title
source: Capture or Select Image
ta: புகைப்படம் எடுக்கவும் அல்லது தேர்ந்தெடுக்கவும்
te: ఫోటో తీయండి లేదా ఎంచుకోండి

# onboardingStep1Desc
source: Take a photo of affected crops or select from gallery
ta: பாதிக்கப்பட்ட பயிர்களின் புகைப்படம் எடுக்கவும் அல்லது கேலரியிலிருந்து தேர்ந்தெடுக்கவும்
te: ప్రభావిత పంటల ఫోటో తీయండి లేదా గ్యాలరీ నుండి ఎంచుకోండి

# onboardingStep2Title
source: Offline Support
ta: ஆஃப்லைன் ஆதரவு
te: ఆఫ్‌లైన్ మద్దతు

# onboardingStep2Desc
source: App works without internet. Photos saved locally.
ta: பயன்பாடு இணையம் இல்லாமல் வேலை செய்கிறது। புகைப்படங்கள் உள்ளூரில் சேமிக்கப்படுகின்றன।
te: యాప్ ఇంటర్నెట్ లేకుండా పని చేస్తుంది। ఫోటోలు స్థానికంగా సేవ్ చేయబడతాయి।

# onboardingStep3Title
source: Multi-Language
ta: பல மொழி
te: బహుభాషా

# onboardingStep3Desc
source: Available in English, Hindi, Telugu, and Tamil
ta: ஆங்கிலம், இந்தி, தெலுங்கு மற்றும் தமிழில் கிடைக்கிறது
te: ఇంగ్లీష్, హిందీ, తెలుగు మరియు తమిళంలో అందుబాటులో ఉంది

# onboardingStep4Title
source: Voice Assistance
ta: குரல் உதவி
te: వాయిస్ సహాయం

# onboardingStep4Desc
source: Tap speaker icon to hear instructions
ta: வழிமுறைகளைக் கேட்க ஸ்பீக்கர் ஐகானை தட்டவும்
te: సూచనలను వినడానికి స్పీకర్ చిహ్నంపై ట్యాప్ చేయండి

source: Skip
ta: தவிர்க்கவும்
te: దాటవేయి

source: Next
ta: அடுத்து
te: తరువాత

source: Get Started
ta: தொடங்குங்கள்
te: ప్రారంభించండి

source: Replay Tutorial
ta: பயிற்சியை மீண்டும் இயக்கவும்
te: ట్యుటోరియల్ మళ్లీ ప్లే చేయండి

source: About
ta: பற்றி
te: గురించి

# appVersion
source: Version 1.0.0
ta: பதிப்பு 1.0.0
te: వెర్షన్ 1.0.0

# voiceInstructionHome
source: Tap camera icon to capture a photo of affected crops, or tap gallery icon to select an existing image
ta: பாதிக்கப்பட்ட பயிர்களின் புகைப்படத்தை எடுக்க கேமரா ஐகானை தட்டவும், அல்லது ஏற்கனவே உள்ள படத்தைத் தேர்ந்தெடுக்க கேலரி ஐகானை தட்டவும்
te: ప్రభావిత పంటల ఫోటో తీయడానికి కెమెరా చిహ్నంపై ట్యాప్ చేయండి, లేదా ఇప్పటికే ఉన్న చిత్రాన్ని ఎంచుకోవడానికి గ్యాలరీ చిహ్నంపై ట్యాప్ చేయండి

# voiceInstructionCapture
source: Tap the circular button to capture photo
ta: புகைப்படம் எடுக்க வட்ட பொத்தானை தட்டவும்
te: ఫోటో తీయడానికి వృత్తాకార బటన్‌పై ట్యాప్ చేయండి

# voiceInstructionPreview
source: Review your image. Tap submit to diagnose or retake to capture again
ta: உங்கள் படத்தை மதிப்பாய்வு செய்யவும். கண்டறிய சமர்ப்பிக்கவும் அல்லது மீண்டும் எடுக்க ரீடேக் தட்டவும்
te: మీ చిత్రాన్ని సమీక్షించండి। నిర్ధారణ కోసం సబ్మిట్‌పై ట్యాప్ చేయండి లేదా మళ్లీ కాప్చర్ చేయడానికి రీటేక్‌పై ట్యాప్ చేయండి

# voiceInstructionSuccess
source: Your submission was successful
ta: உங்கள் சமர்ப்பிப்பு வெற்றிகரமாக இருந்தது
te: మీ సమర్పణ విజయవంతమైంది

# voiceInstructionOffline
source: Your image was saved offline and will upload when you are connected to internet
ta: உங்கள் படம் ஆஃப்லைனில் சேமிக்கப்பட்டுள்ளது மற்றும் நீங்கள் இணையத்துடன் இணைக்கப்பட்டதும் பதிவேற்றப்படும்
te: మీ చిత్రం ఆఫ్‌లైన్‌లో సేవ్ చేయబడింది మరియు మీరు ఇంటర్నెట్‌కు కనెక్ట్ అయినప్పుడు అప్‌లోడ్ అవుతుంది

# errorCameraPermission
source: Camera permission denied
ta: கேமரா அனுமதி மறுக்கப்பட்டது
te: కెమెరా అనుమతి నిరాకరించబడింది

# errorStoragePermission
source: Storage permission denied
ta: சேமிப்பக அனுமதி மறுக்கப்பட்டது
te: నిల్వ అనుమతి నిరాకరించబడింది

# errorInvalidFile
source: Invalid file format
ta: தவறான கோப்பு வடிவம்
te: చెల్లని ఫైల్ ఫార్మాట్

# errorFileTooLarge
source: File size too large
ta: கோப்பு அளவு மிக பெரியது
te: ఫైల్ పరిమాణం చాలా పెద్దది

# errorVideoTooLong
source: Video duration exceeds 30 seconds
ta: வீடியோ கால அளவு 30 விநாடிகளை மீறுகிறது
te: వీడియో వ్యవధి 30 సెకన్లను మించిపోయింది

source: Cancel
ta: ரத்து செய்
te: రద్దు చేయి

source: OK
ta: சரி
te: సరే

source: Saved
ta: சேமிக்கப்பட்டது
te: సేవ్ చేయబడింది

source: Pending
ta: நிலுவையில்
te: పెండింగ్

source: Submitted
ta: சமர்ப்பிக்கப்பட்டது
te: సమర్పించబడింది

source: My Submissions
ta: எனது சமர்ப்பிப்புகள்
te: నా సమర్పణలు

# noSubmissions
source: No submissions yet
ta: இன்னும் சமர்ப்பிப்புகள் இல்லை
te: ఇంకా సమర్పణలు లేవు

# tapToSpeak
source: Tap to hear
ta: கேட்க தட்டவும்
te: వినడానికి ట్యాప్ చేయండి

source: Welcome
ta: வரவேற்கிறோம்
te: స్వాగతం

source: Categories
ta: வகைகள்
te: వర్గాలు

source: View All →
ta: அனைத்தையும் காண →
te: అన్నీ చూడండి →

source: Quick Tips
ta: விரைவான குறிப்புகள்
te: శీఘ్ర చిట్కాలు

source: Use good lighting
ta: நல்ல ஒளியைப் பயன்படுத்தவும்
te: మంచి వెలుతురును ఉపయోగించండి

# useGoodLightingDesc
source: Take a clear photo in bright light for better detection.
ta: சிறந்த கண்டறிதலுக்கு பிரகாசமான ஒளியில் தெளிவான புகைப்படம் எடுக்கவும்.
te: మెరుగైన గుర్తింపు కోసం ప్రకాశవంతమైన కాంతిలో స్పష్టమైన ఫోటో తీయండి.

# focusOnLeaf
source: Focus on the leaf
ta: இலையில் கவனம் செலுத்தவும்
te: ఆకుపై దృష్టి పెట్టండి

# focusOnLeafDesc
source: Keep the affected area centered and avoid blur.
ta: பாதிக்கப்பட்ட பகுதியை மையத்தில் வைத்து மங்கலைத் தவிர்க்கவும்.
te: ప్రభావిత ప్రాంతాన్ని మధ్యలో ఉంచండి మరియు అస్పష్టతను నివారించండి.

source: Clean camera lens
ta: கேமரா லென்ஸை சுத்தம் செய்யவும்
te: కెమెరా లెన్స్ శుభ్రం చేయండి

# cleanCameraLensDesc
source: Wipe the lens for sharper images.
ta: கூர்மையான படங்களுக்கு லென்ஸை துடைக்கவும்.
te: పదునైన చిత్రాల కోసం లెన్స్ తుడవండి.

source: Cereals
ta: தானியங்கள்
te: తృణధాన్యాలు

source: Legumes
ta: பருப்புகள்
te: పప్పులు

source: Fruits
ta: பழங்கள்
te: పండ్లు

source: Vegetables
ta: காய்கறிகள்
te: కూరగాయలు

source: Select Vegetable
ta: காய்கறியைத் தேர்ந்தெடுக்கவும்
te: కూరగాయను ఎంచుకోండి

source: Select Fruit
ta: பழத்தைத் தேர்ந்தெடுக்கவும்
te: పండును ఎంచుకోండి

source: Treatment Steps
ta: சிகிச்சை படிகள்
te: చికిత్స దశలు

# loadingTreatment
source: Loading treatment recommendations...
ta: சிகிச்சை பரிந்துரைகள் ஏற்றப்படுகின்றன...
te: చికిత్స సిఫార్సులు లోడ్ అవుతున్నాయి...

# noTreatmentAvailable
source: No treatment information available
ta: சிகிச்சை தகவல் கிடைக்கவில்லை
te: చికిత్స సమాచారం అందుబాటులో లేదు

source: Retry
ta: மீண்டும் முயற்சிக்கவும்
te: మళ్ళీ ప్రయత్నించండి

source: Weather Alert
ta: வானிலை எச்சரிக்கை
te: వాతావరణ హెచ్చరిక

source: Avoid spraying before rain
ta: மழைக்கு முன் தெளிப்பதைத் தவிர்க்கவும்
te: వర్షానికి ముందు పిచికారీ చేయడం మానుకోండి

source: Organic
ta: இயற்கை
te: సేంద్రీయ

source: Chemical
ta: ரசாயன
te: రసాయన

source: Dosage
ta: அளவு
te: మోతాదు

source: Timing
ta: நேரம்
te: సమయం

source: Safety Warnings:
ta: பாதுகாப்பு எச்சரிக்கைகள்:
te: భద్రతా హెచ్చరికలు:

source: Required safety equipment
ta: தேவையான பாதுகாப்பு உபகரணங்கள்
te: అవసరమైన భద్రతా పరికరాలు

# noTreatmentStepsAvailable
source: No treatment steps available for this option.
ta: இந்த விருப்பத்திற்கு சிகிச்சை படிகள் கிடைக்கவில்லை.
te: ఈ ఎంపికకు చికిత్స దశలు అందుబాటులో లేవు.

source: Step
ta: படி
te: దశ

# warningLabel
source: Warning
ta: எச்சரிக்கை
te: హెచ్చరిక

source: Home
ta: முகப்பு
te: హోమ్

source: Remedies
ta: தீர்வுகள்
te: నివారణలు

source: History
ta: வரலாறு
te: చరిత్ర

source: Account
ta: கணக்கு
te: ఖాతా

source: Logout
ta: வெளியேறு
te: లాగ్అవుట్

# logoutDesc
source: Sign out and return to login screen
ta: வெளியேறி உள்நுழைவு திரைக்குத் திரும்பு
te: సైన్ అవుట్ చేసి లాగిన్ స్క్రీన్‌కు తిరిగి వెళ్ళండి

# voiceAndAccessibility
source: Voice & Accessibility
ta: குரல் & அணுகல்தன்மை
te: వాయిస్ & యాక్సెసిబిలిటీ

source: Voice assistance
ta: குரல் உதவி
te: వాయిస్ సహాయం

# voiceAssistanceDesc
source: Enable/disable voice (read aloud) features
ta: குரல் (சத்தமாக படிக்க) அம்சங்களை இயக்கு/முடக்கு
te: వాయిస్ (బిగ్గరగా చదవడం) ఫీచర్లను ఎనేబుల్/డిసేబుల్ చేయండి

source: Haptic feedback
ta: ஹாப்டிக் பின்னூட்டம்
te: హాప్టిక్ ఫీడ్‌బ్యాక్

# hapticFeedbackDesc
source: Vibrate on interactions (if supported)
ta: தொடர்புகளில் அதிர்வு (ஆதரிக்கப்பட்டால்)
te: ఇంటరాక్షన్‌లపై వైబ్రేట్ చేయండి (సపోర్ట్ ఉంటే)

# syncAndNotifications
source: Sync & Notifications
ta: ஒத்திசைவு & அறிவிப்புகள்
te: సింక్ & నోటిఫికేషన్లు

source: Auto sync
ta: தானியங்கி ஒத்திசைவு
te: ఆటో సింక్

# autoSyncDesc
source: Upload pending items automatically when online
ta: ஆன்லைனில் இருக்கும்போது நிலுவையிலுள்ள உருப்படிகளை தானாக பதிவேற்றவும்
te: ఆన్‌లైన్‌లో ఉన్నప్పుడు పెండింగ్ ఐటమ్‌లను ఆటోమేటిక్‌గా అప్‌లోడ్ చేయండి

source: Notifications
ta: அறிவிப்புகள்
te: నోటిఫికేషన్లు

# notificationsDesc
source: Enable in-app notifications
ta: உள்-செயலி அறிவிப்புகளை இயக்கு
te: ఇన్-యాప్ నోటిఫికేషన్లను ఎనేబుల్ చేయండి

source: Data
ta: தரவு
te: డేటా

source: Clear local history
ta: உள்ளூர் வரலாற்றை அழி
te: స్థానిక చరిత్రను క్లియర్ చేయండి

# clearLocalHistoryDesc
source: Deletes saved submissions and results from this device
ta: இந்தச் சாதனத்திலிருந்து சேமிக்கப்பட்ட சமர்ப்பிப்புகள் மற்றும் முடிவுகளை நீக்கு
te: ఈ పరికరం నుండి సేవ్ చేసిన సబ్‌మిషన్‌లు మరియు ఫలితాలను తొలగించండి

# clearLocalHistoryConfirm
source: Clear local history?
ta: உள்ளூர் வரலாற்றை அழிக்கவா?
te: స్థానిక చరిత్రను క్లియర్ చేయాలా?

# clearLocalHistoryWarning
source: This will remove all locally saved submissions and results. This action cannot be undone.
ta: இது உள்ளூரில் சேமிக்கப்பட்ட அனைத்து சமர்ப்பிப்புகள் மற்றும் முடிவுகளையும் நீக்கும். இந்தச் செயலை மாற்ற முடியாது.
te: ఇది స్థానికంగా సేవ్ చేసిన సబ్‌మిషన్‌లు మరియు ఫలితాలన్నింటినీ తొలగిస్తుంది. ఈ చర్యను తిరిగి చేయలేరు.

source: Clear
ta: அழி
te: క్లియర్

source: Local history cleared
ta: உள்ளூர் வரலாறு அழிக்கப்பட்டது
te: స్థానిక చరిత్ర క్లియర్ చేయబడింది

source: Uploaded Images
ta: பதிவேற்றிய படங்கள்
te: అప్‌లోడ్ చేసిన చిత్రాలు

source: Refresh
ta: புதுப்பி
te: రిఫ్రెష్

source: No history yet
ta: இதுவரை வரலாறு இல்லை
te: ఇంకా చరిత్ర లేదు

# statusSaved
source: Saved (not uploaded)
ta: சேமிக்கப்பட்டது (பதிவேற்றப்படவில்லை)
te: సేవ్ చేయబడింది (అప్‌లోడ్ చేయబడలేదు)

# statusUploading
source: Uploading
ta: பதிவேற்றுகிறது
te: అప్‌లోడ్ అవుతోంది

source: Uploaded
ta: பதிவேற்றப்பட்டது
te: అప్‌లోడ్ చేయబడింది

source: Failed
ta: தோல்வி
te: విఫలమైంది

source: Diagnosed
ta: கண்டறியப்பட்டது
te: నిర్ధారణ చేయబడింది

source: Search crop / disease...
ta: பயிர் / நோயைத் தேடு...
te: పంట / వ్యాధిని శోధించండి...

source: No remedies found
ta: தீர்வுகள் எதுவும் கிடைக்கவில்லை
te: నివారణలు కనుగొనబడలేదు

source: Symptoms
ta: அறிகுறிகள்
te: లక్షణాలు

source: Listen
ta: கேளு
te: వినండి
